jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KWxx_DFP</name>
  <description>Freescale Kinetis KWxx Series Device Support</description>

  <releases>
    <release version="1.3.0" date="2015-10-09">
      Renamed device MKW01Z128xxx5 to MKW01Z128xxx4.
    </release>
    <release version="1.2.0" date="2015-07-10">
      Added FRDM-KW40Z board support.
      Corrected KW40Z Flash Algorithm.
    </release>
    <release version="1.1.0" date="2015-04-29">
      Changed device names according processor expert.
      Added KW4x series device support.
      Updated MKW30Z4, MKW20Z device support
      Corrected SRAM range
    </release>
    <release version="1.0.0">
      First Release version of KWxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>KWxx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="KWxx Series" Dvendor="Freescale:78">

      <!-- ******************************  KW0x  ****************************** -->
      <subFamily DsubFamily="KW0x">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The MKW01 device is highly-integrated, cost-effective, smart radio, sub-1 GHz wireless node solution composed
of a transceiver supporting FSK, GFSK, MSK, or OOK modulations with a low-power ARM® Cortex M0+ CPU. The highly
integrated RF transceiver operates over a wide frequency range including 315 MHz, 433 MHz, 470 MHz, 868 MHz,
915 MHz, 928 MHz, and 955 MHz in the license-free Industrial, Scientific and Medical (ISM) frequency bands. This
configuration allows users to minimize the use of external components.
        </description>

        <!-- ******************************  MKW01Z128xxx4  ****************************** -->
        <device Dname="MKW01Z128xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device\Include\MKW01Z4.h" define="MKW01Z128xxx4"/>
          <debug svd="SVD\MKW01Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash\MK_P128_48MHZ.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents\MKW01Z128.pdf" title="MKW01Z128xxx4 Data Sheet"/>
          <book name="Documents\MKW01xxRM.pdf" title="MKW01Z128xxx4 Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW2x  ****************************** -->
      <subFamily DsubFamily="KW2x">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p0"/>
        <book name="Documents\dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <description>
The MKW2x is a low power, compact integrated device consisting of a high-performance 2.4 GHz IEEE
802.15.4 compliant radio transceiver and a powerful ARM Cortex-M4 MCU system with connectivity and
precision mixed signal analog peripherals.
        </description>

        <!-- ******************************  MKW21D256xxx5  ****************************** -->
        <device Dname="MKW21D256xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKW21D5.h" define="MKW21D256xxx5"/>
          <debug svd="SVD\MKW21D5.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IROM2"                        start="0x10000000" size="0x00010000" default="0" startup="0"/>
          <memory id="IRAM1"                        start="0x1FFFC000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash\MK_P256_50MHZ.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>
          <algorithm name="Flash\MK_D64_50MHZ.FLM"  start="0x10000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents\MKW2xDxxx.pdf"   title="MKW21D256xxx5 Data Sheet"/>
          <book name="Documents\MKW2xDxxxRM.pdf" title="MKW21D256xxx5 Reference Manual"/>
        </device>

        <!-- ******************************  MKW21D512xxx5  ****************************** -->
        <device Dname="MKW21D512xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKW21D5.h" define="MKW21D512xxx5"/>
          <debug svd="SVD\MKW21D5.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFF8000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash\MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000"  RAMsize="0x1000"/>

          <book name="Documents\MKW2xDxxx.pdf"   title="MKW21D512xxx5 Data Sheet"/>
          <book name="Documents\MKW2xDxxxRM.pdf" title="MKW21D512xxx5 Reference Manual"/>
        </device>

        <!-- ******************************  MKW22D512xxx5  ****************************** -->
        <device Dname="MKW22D512xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKW22D5.h" define="MKW22D512xxx5"/>
          <debug svd="SVD\MKW22D5.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFF8000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash\MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

