jack77er/openUTRUSTA/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.3.0.pdsc
    <condition id="MKW20Z4 CMSIS">
      <description>Freescale Kinetis KW20 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW20Z160xxx4"/>
    </condition>

    <condition id="MKW30Z4 CMSIS">
      <description>Freescale Kinetis KW30 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW30Z160xxx4"/>
    </condition>

    <condition id="MKW40Z4 CMSIS">
      <description>Freescale Kinetis KW40 48MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKW40Z160xxx4"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MKW01Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW01Z4 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW01Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW01Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW01Z4.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW21D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW21D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW21D5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW21D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW21D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW22D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW22D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW22D5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW22D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW22D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW24D5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW24D5 CMSIS">
      <description>System Startup for Kinetis KW01 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW24D5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW24D5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW24D5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW20Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW20Z4 CMSIS">
      <description>System Startup for Kinetis KW20 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW40Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW20Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW20Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKW20Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW30Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW30Z4 CMSIS">
      <description>System Startup for Kinetis KW30 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW30Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW30Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW30Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKW30Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKW40Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW40Z4 CMSIS">
      <description>System Startup for Kinetis KW4x 48MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKW40Z4.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKW40Z4.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKW40Z4.c"       attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKW40Z4.h"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="FRDM-KW40Z" Cclass="Board Support" Cversion="1.0.0">
      <description>FRDM-KW40Z Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" condition="MKW40Z4 CMSIS">
      <description>Button driver for Freescale FRDM-KW40Z board</description>
        <files>
          <file category="source" name="Boards\Freescale\FRDM-KW40Z\Common\Buttons_FRDM-KW40Z.c"/>
        </files>
      </component>
